Pandas
what is pandas pandaia is one of the mos widely used python libraries for data analysis and manupulation if is open source and build 
it adds high level data structures and tools that make it easier to work with tabular labeled and heterogenious dataset

Data structures
pandsa introduce tow important data structure series and data frame

usage

In [3]:
import pandas as pd
df =pd.DataFrame({
    "Name":["Alice","BOB"],
    "CGPA":[9.5,8.7]
})

In [4]:
df

    Name  CGPA
0  Alice   9.5
1    BOB   8.7

In [5]:
type(df)

pandas.core.frame.DataFrame

In [6]:
print(type(df))

<class 'pandas.core.frame.DataFrame'>

In [7]:
ser=pd.Series([2,2451,45,24256])
ser

0        2
1     2451
2       45
3    24256
dtype: int64

In [8]:
print(ser)

0        2
1     2451
2       45
3    24256
dtype: int64

In [9]:
print(type(ser))

<class 'pandas.core.series.Series'>

In [13]:
print(ser.index)

RangeIndex(start=0, stop=4, step=1)

characteristic of a series

they are homogeneour store one type of data

#tehy support vectorized operations

#they can handle missing vales with NaN

#they have mutable values but immutable size

In [21]:
#custom indexing
s2=pd.Series([23,24,25,26],index=["adam","Eve","charlie","Bob"])

print(s2["Eve"])
print(s2["Bob"])

24
26

In [22]:
#vecorized Operations
s1=pd.Series([1,2,3])
s2=pd.Series([4,5,6])
print(s1+s2)

0    5
1    7
2    9
dtype: int64

In [23]:
#mutable valuese but immutable sizes

In [25]:
s=pd.Series([1,2,3,3,45,5])
s[0]=111
s

0    111
1      2
2      3
3      3
4     45
5      5
dtype: int64

In [26]:
print(s)

0    111
1      2
2      3
3      3
4     45
5      5
dtype: int64

In [27]:
changed_s=s.drop(1)
print(changed_s)
print(s)

0    111
2      3
3      3
4     45
5      5
dtype: int64
0    111
1      2
2      3
3      3
4     45
5      5
dtype: int64


Data Frame

A Data frame is two dimensional tabular data structure like spredsheet or sql table
it consit of

$rows

In [28]:
#columns

#index(row labels)

column lables

each column is dataframe is series

Usage

In [29]:
# creating dataa frame using pandas using directory

In [31]:
info ={
    "Name":['adam','eve','Bob'],
    'marks':[78,99,85],
    'grade':['b','o','a']
}

In [32]:
info

{'Name': ['adam', 'eve', 'Bob'],
 'marks': [78, 99, 85],
 'grade': ['b', 'o', 'a']}

In [33]:
df=pd.DataFrame(info)

In [34]:
pd

In [35]:
df

   Name  marks grade
0  adam     78     b
1   eve     99     o
2   Bob     85     a

In [38]:
type(df)
import numpy as np

In [40]:
np_arr=np.array([[1,2,3],[4,5,6],[7,8,9]])
df= pd.DataFrame(np_arr,columns=["Col1","col2","col2"])
df

   Col1  col2  col2
0     1     2     3
1     4     5     6
2     7     8     9

In [41]:
#creating dataFrame using List

In [42]:
lis=[["Adam",96],["Eve",75],["Bob",82],['Charlie',92]]
lis

[['Adam', 96], ['Eve', 75], ['Bob', 82], ['Charlie', 92]]

In [45]:
df =pd.DataFrame(lis,columns=["Name","Marks"])

In [47]:
df

      Name  Marks
0     Adam     96
1      Eve     75
2      Bob     82
3  Charlie     92

In [48]:
# working with data files #

most of the time when we dal with data we'll get it in a formaat like csv
(commaseperated fvales or json javascript object notation and pandas make it extremely
easy to read data fromvarious file format

In [49]:
df_csv=pd.read_csv("netflix_titles.csv")
df_csv

,show_id,type,title,director,cast,country,date_added,release_year,rating,duration,listed_in,description
0,s1,Movie,Dick Johnson Is Dead,Kirsten Johnson,NaN,United States,"September 25, 2021",2020,PG-13,90 min,Documentaries,"As her father nears the end of his life, filmm..."
1,s2,TV Show,Blood & Water,NaN,"Ama Qamata, Khosi Ngema, Gail Mabalane, Thaban...",South Africa,"September 24, 2021",2021,TV-MA,2 Seasons,"International TV Shows, TV Dramas, TV Mysteries","After crossing paths at a party, a Cape Town t..."
2,s3,TV Show,Ganglands,Julien Leclercq,"Sami Bouajila, Tracy Gotoas, Samuel Jouy, Nabi...",NaN,"September 24, 2021",2021,TV-MA,1 Season,"Crime TV Shows, International TV Shows, TV Act...",To protect his family from a powerful drug lor...
3,s4,TV Show,Jailbirds New Orleans,NaN,NaN,NaN,"September 24, 2021",2021,TV-MA,1 Season,"Docuseries, Reality TV","Feuds, flirtations and toilet talk go down amo..."
4,s5,TV Show,Kota Factory,NaN,"Mayur More, Jitendra Kumar, Ranjan Raj, Alam K...",India,"September 24, 2021",2021,TV-MA,2 Seasons,"International TV Shows, Romantic TV Shows, TV ...",In a city of coaching centers known to train I...
...,...,...,...,...,...,...,...,...,...,...,...,...
8802,s8803,Movie,Zodiac,David Fincher,"Mark Ruffalo, Jake Gyllenhaal, Robert Downey J...",United States,"November 20, 2019",2007,R,158 min,"Cult Movies, Dramas, Thrillers","A political cartoonist, a crime reporter and a..."
8803,s8804,TV Show,Zombie Dumb,NaN,NaN,NaN,"July 1, 2019",2018,TV-Y7,2 Seasons,"Kids' TV, Korean TV Shows, TV Comedies","While living alone in a spooky town, a young g..."
8804,s8805,Movie,Zombieland,Ruben Fleischer,"Jesse Eisenberg, Woody Harrelson, Emma Stone, ...",United States,"November 1, 2019",2009,R,88 min,"Comedies, Horror Movies",Looking to survive in a world taken over by zo...
8805,s8806,Movie,Zoom,Peter Hewitt,"Tim Allen, Courteney Cox, Chevy Chase, Kate Ma...",United States,"January 11, 2020",2006,PG,88 min,"Children & Family Movies, Comedies","Dragged from civilian life, a former superhero..."
8806,s8807,Movie,Zubaan,Mozez Singh,"Vicky Kaushal, Sarah-Jane Dias, Raaghav Chanan...",India,"March 2, 2019",2015,TV-14,111 min,"Dramas, International Movies, Music & Musicals",A scrappy but poor boy worms his way into a ty...

In [52]:
df_json=pd.read_json("iris.json")

In [55]:
df_json
df_json.to_csv("output.csv")

In [59]:
small=df_json.head(5)

In [60]:
small

   sepal.length  sepal.width  petal.length  petal.width variety
0           5.1          3.5           1.4          0.2  Setosa
1           4.9          3.0           1.4          0.2  Setosa
2           4.7          3.2           1.3          0.2  Setosa
3           4.6          3.1           1.5          0.2  Setosa
4           5.0          3.6           1.4          0.2  Setosa

In [63]:
df_json.tail()

     sepal.length  sepal.width  petal.length  petal.width    variety
145           6.7          3.0           5.2          2.3  Virginica
146           6.3          2.5           5.0          1.9  Virginica
147           6.5          3.0           5.2          2.0  Virginica
148           6.2          3.4           5.4          2.3  Virginica
149           5.9          3.0           5.1          1.8  Virginica

In [65]:
df_json.sample()

     sepal.length  sepal.width  petal.length  petal.width    variety
141           6.9          3.1           5.1          2.3  Virginica

In [66]:
df_json.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 150 entries, 0 to 149
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   sepal.length  150 non-null    float64
 1   sepal.width   150 non-null    float64
 2   petal.length  150 non-null    float64
 3   petal.width   150 non-null    float64
 4   variety       150 non-null    object
dtypes: float64(4), object(1)
memory usage: 6.0+ KB

In [67]:
df_json.describe()

       sepal.length  sepal.width  petal.length  petal.width
count    150.000000   150.000000    150.000000   150.000000
mean       5.843333     3.057333      3.758000     1.199333
std        0.828066     0.435866      1.765298     0.762238
min        4.300000     2.000000      1.000000     0.100000
25%        5.100000     2.800000      1.600000     0.300000
50%        5.800000     3.000000      4.350000     1.300000
75%        6.400000     3.300000      5.100000     1.800000
max        7.900000     4.400000      6.900000     2.500000

In [69]:
df_json.nunique()

sepal.length    35
sepal.width     23
petal.length    43
petal.width     22
variety          3
dtype: int64

In [70]:
df_json.describe()

       sepal.length  sepal.width  petal.length  petal.width
count    150.000000   150.000000    150.000000   150.000000
mean       5.843333     3.057333      3.758000     1.199333
std        0.828066     0.435866      1.765298     0.762238
min        4.300000     2.000000      1.000000     0.100000
25%        5.100000     2.800000      1.600000     0.300000
50%        5.800000     3.000000      4.350000     1.300000
75%        6.400000     3.300000      5.100000     1.800000
max        7.900000     4.400000      6.900000     2.500000

In [73]:
df_json.dtypes

sepal.length    float64
sepal.width     float64
petal.length    float64
petal.width     float64
variety          object
dtype: object

In [74]:
df_json.shape

(150, 5)

In [75]:
df_json.columns

Index(['sepal.length', 'sepal.width', 'petal.length', 'petal.width',
       'variety'],
      dtype='object')

In [77]:
df_json["sepal.length"]

0      5.1
1      4.9
2      4.7
3      4.6
4      5.0
      ...
145    6.7
146    6.3
147    6.5
148    6.2
149    5.9
Name: sepal.length, Length: 150, dtype: float64

In [79]:
df_json[['sepal.length',"petal.length"]]

     sepal.length  petal.length
0             5.1           1.4
1             4.9           1.4
2             4.7           1.3
3             4.6           1.5
4             5.0           1.4
..            ...           ...
145           6.7           5.2
146           6.3           5.0
147           6.5           5.2
148           6.2           5.4
149           5.9           5.1

[150 rows x 2 columns]

In [81]:
df_json.loc[0]

sepal.length       5.1
sepal.width        3.5
petal.length       1.4
petal.width        0.2
variety         Setosa
Name: 0, dtype: object

In [82]:
df_json.loc[0:4]

   sepal.length  sepal.width  petal.length  petal.width variety
0           5.1          3.5           1.4          0.2  Setosa
1           4.9          3.0           1.4          0.2  Setosa
2           4.7          3.2           1.3          0.2  Setosa
3           4.6          3.1           1.5          0.2  Setosa
4           5.0          3.6           1.4          0.2  Setosa

In [84]:
df_json.loc[0,'petal.width']

np.float64(0.2)

In [85]:
df_json.iloc[0]

sepal.length       5.1
sepal.width        3.5
petal.length       1.4
petal.width        0.2
variety         Setosa
Name: 0, dtype: object

In [86]:
df_json.iloc[:3]

   sepal.length  sepal.width  petal.length  petal.width variety
0           5.1          3.5           1.4          0.2  Setosa
1           4.9          3.0           1.4          0.2  Setosa
2           4.7          3.2           1.3          0.2  Setosa

In [89]:
df_json.iloc[1,4]

'Setosa'

In [90]:
df_json.iloc[0,2]

np.float64(1.4)

In [92]:
print(df_json.at[0,'sepal.length'])

5.1

In [95]:
print(df_json.iat[0,2])

1.4

In [96]:
data=df_json

In [99]:
data[data['sepal.length']>6]

     sepal.length  sepal.width  petal.length  petal.width     variety
50            7.0          3.2           4.7          1.4  Versicolor
51            6.4          3.2           4.5          1.5  Versicolor
52            6.9          3.1           4.9          1.5  Versicolor
54            6.5          2.8           4.6          1.5  Versicolor
56            6.3          3.3           4.7          1.6  Versicolor
..            ...          ...           ...          ...         ...
144           6.7          3.3           5.7          2.5   Virginica
145           6.7          3.0           5.2          2.3   Virginica
146           6.3          2.5           5.0          1.9   Virginica
147           6.5          3.0           5.2          2.0   Virginica
148           6.2          3.4           5.4          2.3   Virginica

[61 rows x 5 columns]

In [103]:
data[(data['sepal.length']>7) & (data['petal.length']>4)]

     sepal.length  sepal.width  petal.length  petal.width    variety
102           7.1          3.0           5.9          2.1  Virginica
105           7.6          3.0           6.6          2.1  Virginica
107           7.3          2.9           6.3          1.8  Virginica
109           7.2          3.6           6.1          2.5  Virginica
117           7.7          3.8           6.7          2.2  Virginica
118           7.7          2.6           6.9          2.3  Virginica
122           7.7          2.8           6.7          2.0  Virginica
125           7.2          3.2           6.0          1.8  Virginica
129           7.2          3.0           5.8          1.6  Virginica
130           7.4          2.8           6.1          1.9  Virginica
131           7.9          3.8           6.4          2.0  Virginica
135           7.7          3.0           6.1          2.3  Virginica

In [119]:
df =pd.read_csv("raw_data.csv")

In [120]:
df

    id          name   age country   gender   income
0    1      John Doe  29.0     USA     Male  55000.0
1    1      John Doe  29.0     USA     Male  55000.0
2    2    Jane Smith   NaN  Canada   Female  62000.0
3    3          Alex   NaN     USA  Unknown  47000.0
4    4  Maria Garcia  34.0   Spain   Female      NaN
5    5        Li Wei  27.0   China     Male  51000.0
6    6           NaN  45.0   India   Female  73000.0
7    7    Ahmed Khan  38.0     NaN     Male  68000.0
8    8    Rachel Lee  29.0     USA   Female  62000.0
9    9   Carlos Ruiz   NaN  Mexico     Male  45000.0
10  10   Emily Davis  31.0     USA      NaN  58000.0

In [124]:
df.query("age >30 and income<80000")

    id         name   age country  gender   income
6    6          NaN  45.0   India  Female  73000.0
7    7   Ahmed Khan  38.0     NaN    Male  68000.0
10  10  Emily Davis  31.0     USA     NaN  58000.0

In [122]:
my_country ="IN"
df.query("country == @my_country")

Empty DataFrame
Columns: [id, name, age, country, gender, income]
Index: []

In [ ]:
we writ